In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [8]:
df['RecentDelays'].count()

5

In [42]:
df['FlightNumber']=10045
multiplier=0

In [43]:
df['FlightNumber']

0    10045
1    10045
2    10045
3    10045
4    10045
Name: FlightNumber, dtype: int64

In [44]:
for i in range(0,5):
    df.at[i,'FlightNumber']+=multiplier*10
    multiplier+=1
df

            From_To  FlightNumber  RecentDelays              Airline        1
0      LoNDon_paris         10045      [23, 47]               KLM(!)    968.0
1      MAdrid_miLAN         10055            []    <Air France> (12)    978.0
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )  10155.0
3    Budapest_PaRis         10075          [13]       12. Air France  10175.0
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"  10195.0

In [36]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int32
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
 4   1             5 non-null      float64
dtypes: float64(1), int32(1), object(3)
memory usage: 308.0+ bytes

In [38]:
df

            From_To  FlightNumber  RecentDelays              Airline        1
0      LoNDon_paris         10055      [23, 47]               KLM(!)    968.0
1      MAdrid_miLAN         10065            []    <Air France> (12)    978.0
2  londON_StockhOlm         10075  [24, 43, 87]  (British Airways. )  10155.0
3    Budapest_PaRis         10085          [13]       12. Air France  10175.0
4   Brussels_londOn         10095      [67, 32]          "Swiss Air"  10195.0

In [60]:
df1=df['From_To']
df1[0]

'LoNDon_paris'

In [62]:
from_=[]
to=[]

for  i in range(0,5):
    x,y=df1[i].split('_',1)
    from_.append(x)
    to.append(y)

In [69]:
from_

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [64]:
to

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [65]:
df

            From_To  FlightNumber  RecentDelays              Airline        1
0      LoNDon_paris         10045      [23, 47]               KLM(!)    968.0
1      MAdrid_miLAN         10055            []    <Air France> (12)    978.0
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )  10155.0
3    Budapest_PaRis         10075          [13]       12. Air France  10175.0
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"  10195.0

In [66]:
df=df.drop('From_To',axis=1)
df

   FlightNumber  RecentDelays              Airline        1
0         10045      [23, 47]               KLM(!)    968.0
1         10055            []    <Air France> (12)    978.0
2         10065  [24, 43, 87]  (British Airways. )  10155.0
3         10075          [13]       12. Air France  10175.0
4         10085      [67, 32]          "Swiss Air"  10195.0

In [70]:
for i in range(0,5):
    from_[i]=from_[i].capitalize()
    to[i]=to[i].capitalize()

In [72]:
from_,to

(['London', 'Madrid', 'London', 'Budapest', 'Brussels'],
 ['Paris', 'Milan', 'Stockholm', 'Paris', 'London'])

In [73]:
df['From']=from_

In [75]:
df['To']=to

In [76]:
df

,FlightNumber,RecentDelays,Airline,1,From,To
0,10045,"[23, 47]",KLM(!),968.0,London,Paris
1,10055,[],<Air France> (12),978.0,Madrid,Milan
2,10065,"[24, 43, 87]",(British Airways. ),10155.0,London,Stockholm
3,10075,[13],12. Air France,10175.0,Budapest,Paris
4,10085,"[67, 32]","""Swiss Air""",10195.0,Brussels,London

In [77]:
df.columns

Index(['FlightNumber', 'RecentDelays', 'Airline', 1, 'From', 'To'], dtype='object')

In [81]:
df4=df[['From', 'To','FlightNumber', 'RecentDelays', 'Airline', 1]]
df4

,From,To,FlightNumber,RecentDelays,Airline,1
0,London,Paris,10045,"[23, 47]",KLM(!),968.0
1,Madrid,Milan,10055,[],<Air France> (12),978.0
2,London,Stockholm,10065,"[24, 43, 87]",(British Airways. ),10155.0
3,Budapest,Paris,10075,[13],12. Air France,10175.0
4,Brussels,London,10085,"[67, 32]","""Swiss Air""",10195.0

In [88]:
df5=df['RecentDelays']